# Reshaping & Pivoting in Pandas

In this notebook, I'm going to show reshaping & pivoting in Pandas.
</br>
Happy Learning

In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=[list("aabb"),[1,2]*2],
    columns=[["num","num",
              "comp","comp"],
             ["math","stat"]*2])
data

     num      comp
    math stat math stat
a 1    0    1    2    3
  2    4    5    6    7
b 1    8    9   10   11
  2   12   13   14   15

In [3]:
data.index.names=["class","exam"]
data.columns.names=["field","lesson"]
data

field       num      comp
lesson     math stat math stat
class exam
a     1       0    1    2    3
      2       4    5    6    7
b     1       8    9   10   11
      2      12   13   14   15

In [5]:
long = data.stack(future_stack=True)

In [6]:
long

field              num  comp
class exam lesson
a     1    math      0     2
           stat      1     3
      2    math      4     6
           stat      5     7
b     1    math      8    10
           stat      9    11
      2    math     12    14
           stat     13    15

In [7]:
long.unstack()

field       num      comp
lesson     math stat math stat
class exam
a     1       0    1    2    3
      2       4    5    6    7
b     1       8    9   10   11
      2      12   13   14   15

In [9]:
stacked_data = data.stack(future_stack=True)

In [11]:
stacked_data = data.stack(0, future_stack=True)

In [13]:
stacked_data = data.stack("field", future_stack=True)

In [14]:
s1=pd.Series(
    np.arange(4),index=list("abcd"))
s2=pd.Series(
    np.arange(6,9),index=list("cde"))

In [15]:
print(s1)
print(s2)

a    0
b    1
c    2
d    3
dtype: int32
c    6
d    7
e    8
dtype: int32

In [16]:
data2=pd.concat([s1,s2],keys=["bir","iki"])
data2

bir  a    0
     b    1
     c    2
     d    3
iki  c    6
     d    7
     e    8
dtype: int32

In [17]:
data2.unstack()

       a    b    c    d    e
bir  0.0  1.0  2.0  3.0  NaN
iki  NaN  NaN  6.0  7.0  8.0

In [25]:
stacked_data2 = data2.unstack().stack(future_stack=True)

## Pivoting “Long” to “Wide” Format

In [29]:
stock=pd.DataFrame(
    {"fruit": ["apple", "plum","grape"]*2,
     "color": ["purple","yellow"]*3,
     "piece":[3,4,5,6,1,2]})

In [30]:
stock

   fruit   color  piece
0  apple  purple      3
1   plum  yellow      4
2  grape  purple      5
3  apple  yellow      6
4   plum  purple      1
5  grape  yellow      2

In [34]:
stock.pivot(index="fruit", columns="color", values="piece")

color  purple  yellow
fruit
apple       3       6
grape       5       2
plum        1       4

In [35]:
stock["value"]=np.random.randn(len(stock))

In [36]:
stock

   fruit   color  piece     value
0  apple  purple      3  1.392657
1   plum  yellow      4  1.419263
2  grape  purple      5 -0.495623
3  apple  yellow      6  0.659401
4   plum  purple      1  0.302442
5  grape  yellow      2 -0.989193

In [38]:
p = stock.pivot(index="fruit", columns="color", values="piece")
print(p)

color  purple  yellow
fruit
apple       3       6
grape       5       2
plum        1       4

In [41]:
print(p.columns)

Index(['purple', 'yellow'], dtype='object', name='color')

## Pivoting “Wide” to “Long” Format

In [42]:
data=pd.DataFrame(
    {"lesson":["math","stat","bio"],
     "Sam":[50,60,70],
     "Kim":[80,70,90],
     "Tom":[60,70,85]})
data

  lesson  Sam  Kim  Tom
0   math   50   80   60
1   stat   60   70   70
2    bio   70   90   85

In [43]:
group=pd.melt(data,["lesson"])

In [44]:
group

  lesson variable  value
0   math      Sam     50
1   stat      Sam     60
2    bio      Sam     70
3   math      Kim     80
4   stat      Kim     70
5    bio      Kim     90
6   math      Tom     60
7   stat      Tom     70
8    bio      Tom     85

In [46]:
data = group.pivot(index="lesson", columns="variable", values="value")

In [47]:
data.reset_index()

variable lesson  Kim  Sam  Tom
0           bio   90   70   85
1          math   80   50   60
2          stat   70   60   70